alibaba/AliOS-Things/platform/mcu/atsaml21/saml21b/atdf/ATSAML21E18B.atdf
        <module name="PORT" id="U2210" version="2.0.1">
          <instance name="PORT">
            <register-group name="PORT" name-in-module="PORT" address-space="base" offset="0x40002800"/>
            <register-group name="PORT_IOBUS" name-in-module="PORT" address-space="base" offset="0x60000000"/>
            <signals>
              <signal group="P" index="0" function="default" pad="PA00"/>
              <signal group="P" index="1" function="default" pad="PA01"/>
              <signal group="P" index="2" function="default" pad="PA02"/>
              <signal group="P" index="3" function="default" pad="PA03"/>
              <signal group="P" index="4" function="default" pad="PA04"/>
              <signal group="P" index="5" function="default" pad="PA05"/>
              <signal group="P" index="6" function="default" pad="PA06"/>
              <signal group="P" index="7" function="default" pad="PA07"/>
              <signal group="P" index="8" function="default" pad="PA08"/>
              <signal group="P" index="9" function="default" pad="PA09"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="18" function="default" pad="PA18"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="27" function="default" pad="PA27"/>
              <signal group="P" index="30" function="default" pad="PA30"/>
              <signal group="P" index="31" function="default" pad="PA31"/>
            </signals>
            <parameters>
              <param name="BITS" value="84"/>
              <param name="DRVSTR" value="1"/>
              <param name="EV_NUM" value="4"/>
              <param name="GROUPS" value="1"/>
              <param name="ODRAIN" value="0"/>
              <param name="SLEWLIM" value="0"/>
              <param name="INSTANCE_ID" value="10"/>
            </parameters>
          </instance>
        </module>
        <module name="PTC" id="U2215" version="2.1.0">
          <instance name="PTC">
            <register-group name="PTC" name-in-module="PTC" address-space="base" offset="0x43001400"/>
            <signals>
              <signal group="X" index="0" function="B_PTCX" pad="PA08"/>
              <signal group="X" index="1" function="B_PTCX" pad="PA09"/>
              <signal group="X" index="2" function="B_PTCX" pad="PA10"/>
              <signal group="X" index="3" function="B_PTCX" pad="PA11"/>
              <signal group="X" index="4" function="B_PTCX" pad="PA16"/>
              <signal group="X" index="5" function="B_PTCX" pad="PA17"/>
              <signal group="X" index="6" function="B_PTCX" pad="PA18"/>
              <signal group="X" index="7" function="B_PTCX" pad="PA19"/>
              <signal group="X" index="10" function="B_PTCX" pad="PA22"/>
              <signal group="X" index="11" function="B_PTCX" pad="PA23"/>
              <signal group="Y" index="0" function="B_PTCY" pad="PA02"/>
              <signal group="Y" index="1" function="B_PTCY" pad="PA03"/>
              <signal group="Y" index="4" function="B_PTCY" pad="PA06"/>
              <signal group="Y" index="6" function="B_PTCY" pad="PA08"/>
              <signal group="Y" index="7" function="B_PTCY" pad="PA09"/>
              <signal group="Y" index="8" function="B_PTCY" pad="PA10"/>
              <signal group="Y" index="9" function="B_PTCY" pad="PA11"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="33"/>
              <param name="INSTANCE_ID" value="101"/>
            </parameters>
          </instance>
        </module>
        <module name="RSTC" id="U2239" version="1.1.0">
          <instance name="RSTC">
            <register-group name="RSTC" name-in-module="RSTC" address-space="base" offset="0x40000800"/>
            <signals>
              <signal group="EXTWAKE" index="0" function="A_EXTWAKE" pad="PA00"/>
              <signal group="EXTWAKE" index="1" function="A_EXTWAKE" pad="PA01"/>
              <signal group="EXTWAKE" index="2" function="A_EXTWAKE" pad="PA02"/>
              <signal group="EXTWAKE" index="3" function="A_EXTWAKE" pad="PA03"/>
              <signal group="EXTWAKE" index="4" function="A_EXTWAKE" pad="PA04"/>
              <signal group="EXTWAKE" index="5" function="A_EXTWAKE" pad="PA05"/>
              <signal group="EXTWAKE" index="6" function="A_EXTWAKE" pad="PA06"/>
              <signal group="EXTWAKE" index="7" function="A_EXTWAKE" pad="PA07"/>
            </signals>
            <parameters>
              <param name="NUMBER_OF_EXTWAKE" value="8"/>
              <param name="INSTANCE_ID" value="2"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="U2250" version="1.1.0">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x40002000"/>
            <parameters>
              <param name="ALARM_NUM" value="1"/>
              <param name="COMP16_NUM" value="2"/>
              <param name="COMP32_NUM" value="1"/>
              <param name="GPR_NUM" value="4"/>
              <param name="PER_NUM" value="8"/>
              <param name="INSTANCE_ID" value="8"/>
            </parameters>
          </instance>
        </module>
        <module name="SERCOM" id="U2201" version="2.2.0">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x42000000"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA04"/>
              <signal group="PAD" index="0" function="C" pad="PA08"/>
              <signal group="PAD" index="1" function="D" pad="PA05"/>
              <signal group="PAD" index="1" function="C" pad="PA09"/>
              <signal group="PAD" index="2" function="D" pad="PA06"/>
              <signal group="PAD" index="2" function="C" pad="PA10"/>
              <signal group="PAD" index="3" function="D" pad="PA07"/>
              <signal group="PAD" index="3" function="C" pad="PA11"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="1"/>
              <param name="DMAC_ID_TX" value="2"/>
              <param name="GCLK_ID_CORE" value="18"/>
              <param name="GCLK_ID_SLOW" value="17"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="INSTANCE_ID" value="64"/>
            </parameters>
          </instance>
          <instance name="SERCOM1">
            <register-group name="SERCOM1" name-in-module="SERCOM" address-space="base" offset="0x42000400"/>
            <signals>
              <signal group="PAD" index="0" function="C" pad="PA16"/>
              <signal group="PAD" index="0" function="D" pad="PA00"/>
              <signal group="PAD" index="1" function="C" pad="PA17"/>
              <signal group="PAD" index="1" function="D" pad="PA01"/>
              <signal group="PAD" index="2" function="D" pad="PA30"/>
              <signal group="PAD" index="2" function="C" pad="PA18"/>
              <signal group="PAD" index="3" function="D" pad="PA31"/>
              <signal group="PAD" index="3" function="C" pad="PA19"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="3"/>
              <param name="DMAC_ID_TX" value="4"/>
              <param name="GCLK_ID_CORE" value="19"/>
              <param name="GCLK_ID_SLOW" value="17"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="INSTANCE_ID" value="65"/>
            </parameters>
          </instance>
