alibaba/AliOS-Things/platform/mcu/atsaml21/saml21b/atdf/ATSAML21E18B.atdf
      <value-group name="GCLK_GENCTRL__SRC">
        <value name="XOSC" caption="XOSC oscillator output" value="0"/>
        <value name="GCLKIN" caption="Generator input pad" value="1"/>
        <value name="GCLKGEN1" caption="Generic clock generator 1 output" value="2"/>
        <value name="OSCULP32K" caption="OSCULP32K oscillator output" value="3"/>
        <value name="OSC32K" caption="OSC32K oscillator output" value="4"/>
        <value name="XOSC32K" caption="XOSC32K oscillator output" value="5"/>
        <value name="OSC16M" caption="OSC16M oscillator output" value="6"/>
        <value name="DFLL48M" caption="DFLL48M output" value="7"/>
        <value name="DPLL96M" caption="DPLL96M output" value="8"/>
      </value-group>
      <value-group name="GCLK_PCHCTRL__GEN">
        <value name="GCLK0" caption="Generic clock generator 0" value="0x0"/>
        <value name="GCLK1" caption="Generic clock generator 1" value="0x1"/>
        <value name="GCLK2" caption="Generic clock generator 2" value="0x2"/>
        <value name="GCLK3" caption="Generic clock generator 3" value="0x3"/>
        <value name="GCLK4" caption="Generic clock generator 4" value="0x4"/>
        <value name="GCLK5" caption="Generic clock generator 5" value="0x5"/>
        <value name="GCLK6" caption="Generic clock generator 6" value="0x6"/>
        <value name="GCLK7" caption="Generic clock generator 7" value="0x7"/>
        <value name="GCLK8" caption="Generic clock generator 8" value="0x8"/>
      </value-group>
    </module>
    <module name="MCLK" id="U2234" version="1.0.1" caption="Main Clock">
      <register-group name="MCLK" caption="Main Clock">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
        </register>
        <register name="INTENCLR" offset="0x1" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x2" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x3" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x01" caption="Interrupt Flag Status and Clear">
          <bitfield name="CKRDY" caption="Clock Ready" mask="0x1"/>
        </register>
        <register name="CPUDIV" offset="0x4" rw="RW" size="1" initval="0x01" caption="CPU Clock Division">
          <bitfield name="CPUDIV" caption="CPU Clock Division Factor" mask="0xFF" values="MCLK_CPUDIV__CPUDIV"/>
        </register>
        <register name="LPDIV" offset="0x5" rw="RW" size="1" initval="0x01" caption="Low-Power Clock Division">
          <bitfield name="LPDIV" caption="Low-Power Clock Division Factor" mask="0xFF" values="MCLK_LPDIV__LPDIV"/>
        </register>
        <register name="BUPDIV" offset="0x6" rw="RW" size="1" initval="0x01" caption="Backup Clock Division">
          <bitfield name="BUPDIV" caption="Backup Clock Division Factor" mask="0xFF" values="MCLK_BUPDIV__BUPDIV"/>
        </register>
        <register name="AHBMASK" offset="0x10" rw="RW" size="4" initval="0x000FFFFF" caption="AHB Mask">
          <bitfield name="HPB0_" caption="HPB0 AHB Clock Mask" mask="0x1"/>
          <bitfield name="HPB1_" caption="HPB1 AHB Clock Mask" mask="0x2"/>
          <bitfield name="HPB2_" caption="HPB2 AHB Clock Mask" mask="0x4"/>
          <bitfield name="HPB3_" caption="HPB3 AHB Clock Mask" mask="0x8"/>
          <bitfield name="HPB4_" caption="HPB4 AHB Clock Mask" mask="0x10"/>
          <bitfield name="DSU_" caption="DSU AHB Clock Mask" mask="0x20"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL AHB Clock Mask" mask="0x100"/>
          <bitfield name="HSRAM_" caption="HSRAM AHB Clock Mask" mask="0x200"/>
          <bitfield name="LPRAM_" caption="LPRAM AHB Clock Mask" mask="0x400"/>
          <bitfield name="DMAC_" caption="DMAC AHB Clock Mask" mask="0x800"/>
          <bitfield name="USB_" caption="USB AHB Clock Mask" mask="0x1000"/>
          <bitfield name="PAC_" caption="PAC AHB Clock Mask" mask="0x4000"/>
          <bitfield name="NVMCTRL_PICACHU_" caption="NVMCTRL_PICACHU AHB Clock Mask" mask="0x8000"/>
          <bitfield name="L2HBRIDGES_H_" caption="L2HBRIDGES_H AHB Clock Mask" mask="0x10000"/>
          <bitfield name="H2LBRIDGES_H_" caption="H2LBRIDGES_H AHB Clock Mask" mask="0x20000"/>
          <bitfield name="HSRAM_AHBSETUPKEEPER_" caption="HSRAM_AHBSETUPKEEPER AHB Clock Mask" mask="0x40000"/>
          <bitfield name="HSRAM_HMATRIXLP2HMCRAMCHSBRIDGE_" caption="HSRAM_HMATRIXLP2HMCRAMCHSBRIDGE AHB Clock Mask" mask="0x80000"/>
        </register>
        <register name="APBAMASK" offset="0x14" rw="RW" size="4" initval="0x00001FFF" caption="APBA Mask">
          <bitfield name="PM_" caption="PM APB Clock Enable" mask="0x1"/>
          <bitfield name="MCLK_" caption="MCLK APB Clock Enable" mask="0x2"/>
          <bitfield name="RSTC_" caption="RSTC APB Clock Enable" mask="0x4"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL APB Clock Enable" mask="0x8"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL APB Clock Enable" mask="0x10"/>
          <bitfield name="SUPC_" caption="SUPC APB Clock Enable" mask="0x20"/>
          <bitfield name="GCLK_" caption="GCLK APB Clock Enable" mask="0x40"/>
          <bitfield name="WDT_" caption="WDT APB Clock Enable" mask="0x80"/>
          <bitfield name="RTC_" caption="RTC APB Clock Enable" mask="0x100"/>
          <bitfield name="EIC_" caption="EIC APB Clock Enable" mask="0x200"/>
          <bitfield name="PORT_" caption="PORT APB Clock Enable" mask="0x400"/>
        </register>
        <register name="APBBMASK" offset="0x18" rw="RW" size="4" initval="0x00000017" caption="APBB Mask">
          <bitfield name="USB_" caption="USB APB Clock Enable" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU APB Clock Enable" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL APB Clock Enable" mask="0x4"/>
        </register>
        <register name="APBCMASK" offset="0x1C" rw="RW" size="4" initval="0x00007FFF" caption="APBC Mask">
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Clock Enable" mask="0x1"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Clock Enable" mask="0x2"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 APB Clock Enable" mask="0x4"/>
          <bitfield name="SERCOM3_" caption="SERCOM3 APB Clock Enable" mask="0x8"/>
          <bitfield name="SERCOM4_" caption="SERCOM4 APB Clock Enable" mask="0x10"/>
          <bitfield name="TCC0_" caption="TCC0 APB Clock Enable" mask="0x20"/>
          <bitfield name="TCC1_" caption="TCC1 APB Clock Enable" mask="0x40"/>
          <bitfield name="TCC2_" caption="TCC2 APB Clock Enable" mask="0x80"/>
          <bitfield name="TC0_" caption="TC0 APB Clock Enable" mask="0x100"/>
          <bitfield name="TC1_" caption="TC1 APB Clock Enable" mask="0x200"/>
          <bitfield name="DAC_" caption="DAC APB Clock Enable" mask="0x1000"/>
          <bitfield name="AES_" caption="AES APB Clock Enable" mask="0x2000"/>
          <bitfield name="TRNG_" caption="TRNG APB Clock Enable" mask="0x4000"/>
        </register>
