alibaba/AliOS-Things/platform/mcu/atsaml21/saml21b/atdf/ATSAML21E18B.atdf
      <value-group name="NVMCTRL_CTRLB__RWS">
        <value name="SINGLE" caption="Single Auto Wait State" value="0"/>
        <value name="HALF" caption="Half Auto Wait State" value="1"/>
        <value name="DUAL" caption="Dual Auto Wait State" value="2"/>
      </value-group>
      <value-group name="NVMCTRL_CTRLB__SLEEPPRM">
        <value name="WAKEONACCESS" caption="NVM block enters low-power mode when entering sleep.NVM block exits low-power mode upon first access." value="0"/>
        <value name="WAKEUPINSTANT" caption="NVM block enters low-power mode when entering sleep.NVM block exits low-power mode when exiting sleep." value="1"/>
        <value name="DISABLED" caption="Auto power reduction disabled." value="3"/>
      </value-group>
      <value-group name="NVMCTRL_PARAM__PSZ">
        <value name="8" caption="8 bytes" value="0x0"/>
        <value name="16" caption="16 bytes" value="0x1"/>
        <value name="32" caption="32 bytes" value="0x2"/>
        <value name="64" caption="64 bytes" value="0x3"/>
        <value name="128" caption="128 bytes" value="0x4"/>
        <value name="256" caption="256 bytes" value="0x5"/>
        <value name="512" caption="512 bytes" value="0x6"/>
        <value name="1024" caption="1024 bytes" value="0x7"/>
      </value-group>
    </module>
    <module name="FUSES" id="U2207" version="3.0.2" caption="Non-Volatile Fuses">
      <register-group name="OTP5_FUSES">
        <register name="OTP5_WORD_0" offset="0x0" size="4" rw="R" caption="OTP5 Page Word 0">
          <bitfield name="ADC_BIASREFBUF" caption="ADC Bias Reference Buffer Scaling" mask="0x7"/>
          <bitfield name="ADC_BIASCOMP" caption="ADC Comparator Scaling" mask="0x38"/>
          <bitfield name="USB_TRANSN" caption="USB pad Transn calibration" mask="0x3E000"/>
          <bitfield name="USB_TRANSP" caption="USB pad Transp calibration" mask="0x7C0000"/>
          <bitfield name="USB_TRIM" caption="USB pad Trim calibration" mask="0x3800000"/>
        </register>
      </register-group>
      <register-group name="TEMP_LOG_FUSES">
        <register name="TEMP_LOG_WORD_0" offset="0x0" size="4" rw="R" caption="TEMP_LOG Page Word 0">
          <bitfield name="ROOM_TEMP_VAL_INT" caption="Integer part of room temperature in oC" mask="0xFF"/>
          <bitfield name="ROOM_TEMP_VAL_DEC" caption="Decimal part of room temperature" mask="0xF00"/>
          <bitfield name="HOT_TEMP_VAL_INT" caption="Integer part of hot temperature in oC" mask="0xFF000"/>
          <bitfield name="HOT_TEMP_VAL_DEC" caption="Decimal part of hot temperature" mask="0xF00000"/>
          <bitfield name="ROOM_INT1V_VAL" caption="2's complement of the internal 1V reference drift at room temperature (versus a 1.0 centered value)" mask="0xFF000000"/>
        </register>
        <register name="TEMP_LOG_WORD_1" offset="0x4" size="4" rw="R" caption="TEMP_LOG Page Word 1">
          <bitfield name="HOT_INT1V_VAL" caption="2's complement of the internal 1V reference drift at hot temperature (versus a 1.0 centered value)" mask="0xFF"/>
          <bitfield name="ROOM_ADC_VAL" caption="12-bit ADC conversion at room temperature" mask="0xFFF00"/>
          <bitfield name="HOT_ADC_VAL" caption="12-bit ADC conversion at hot temperature" mask="0xFFF00000"/>
        </register>
      </register-group>
      <register-group name="USER_FUSES">
        <register name="USER_WORD_0" offset="0x0" size="4" rw="RW" caption="USER Page Word 0">
          <bitfield name="NVMCTRL_BOOTPROT" caption="Bootloader Size" mask="0x7"/>
          <bitfield name="NVMCTRL_EEPROM_SIZE" caption="EEPROM Size" mask="0x70"/>
          <bitfield name="BOD33USERLEVEL" caption="BOD33 User Level" mask="0x3F00"/>
          <bitfield name="BOD33_DIS" caption="BOD33 Disable" mask="0x4000"/>
          <bitfield name="BOD33_ACTION" caption="BOD33 Action" mask="0x18000"/>
          <bitfield name="BOD12_DIS" caption="BOD12 Disable" mask="0x800000"/>
          <bitfield name="WDT_ENABLE" caption="WDT Enable" mask="0x4000000"/>
          <bitfield name="WDT_ALWAYSON" caption="WDT Always On" mask="0x8000000"/>
          <bitfield name="WDT_PER" caption="WDT Period" mask="0xF0000000"/>
        </register>
        <register name="USER_WORD_1" offset="0x4" size="4" rw="RW" caption="USER Page Word 1">
          <bitfield name="WDT_WINDOW" caption="WDT Window" mask="0xF"/>
          <bitfield name="WDT_EWOFFSET" caption="WDT Early Warning Offset" mask="0xF0"/>
          <bitfield name="WDT_WEN" caption="WDT Window Mode Enable" mask="0x100"/>
          <bitfield name="BOD33_HYST" caption="BOD33 Hysteresis" mask="0x200"/>
          <bitfield name="BOD12_HYST" caption="BOD12 Hysteresis" mask="0x400"/>
          <bitfield name="NVMCTRL_REGION_LOCKS" caption="NVM Region Locks" mask="0xFFFF0000"/>
        </register>
      </register-group>
    </module>
    <module name="OPAMP" id="U2237" version="1.1.0" caption="Operational Amplifier">
      <register-group name="OPAMP" caption="Operational Amplifier">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="LPMUX" caption="Low-Power Mux" mask="0x80"/>
        </register>
        <register name="STATUS" offset="0x2" rw="R" size="1" initval="0x00" caption="Status">
          <bitfield name="READY0" caption="OPAMP 0 Ready" mask="0x1"/>
          <bitfield name="READY1" caption="OPAMP 1 Ready" mask="0x2"/>
          <bitfield name="READY2" caption="OPAMP 2 Ready" mask="0x4"/>
        </register>
        <register name="OPAMPCTRL" offset="0x4" rw="RW" size="4" count="3" initval="0x00000000" caption="OPAMP n Control">
          <bitfield name="ENABLE" caption="Operational Amplifier Enable" mask="0x2"/>
          <bitfield name="ANAOUT" caption="Analog Output" mask="0x4"/>
          <bitfield name="BIAS" caption="Bias Selection" mask="0x18"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="RES2OUT" caption="Resistor ladder To Output" mask="0x100"/>
          <bitfield name="RES2VCC" caption="Resistor ladder To VCC" mask="0x200"/>
          <bitfield name="RES1EN" caption="Resistor 1 Enable" mask="0x400"/>
          <bitfield name="RES1MUX" caption="Resistor 1 Mux" mask="0x1800"/>
          <bitfield name="POTMUX" caption="Potentiometer Selection" mask="0xE000"/>
          <bitfield name="MUXPOS" caption="Positive Input Mux Selection" mask="0x70000"/>
          <bitfield name="MUXNEG" caption="Negative Input Mux Selection" mask="0x700000"/>
        </register>
      </register-group>
    </module>
    <module name="OSCCTRL" id="U2119" version="1.1.0" caption="Oscillators Control">
      <register-group name="OSCCTRL" caption="Oscillators Control">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSCRDY" caption="XOSC Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OSC16MRDY" caption="OSC16M Ready Interrupt Enable" mask="0x10"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready Interrupt Enable" mask="0x100"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds Interrupt Enable" mask="0x200"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine Interrupt Enable" mask="0x400"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse Interrupt Enable" mask="0x800"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped Interrupt Enable" mask="0x1000"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise Interrupt Enable" mask="0x10000"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall Interrupt Enable" mask="0x20000"/>
          <bitfield name="DPLLLTO" caption="DPLL Time Out Interrupt Enable" mask="0x40000"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Ratio Ready Interrupt Enable" mask="0x80000"/>
        </register>
