alibaba/AliOS-Things/platform/mcu/atsaml21/saml21b/atdf/ATSAML21E18B.atdf
        <register modes="HOST" name="BINTERVAL" offset="0x3" rw="RW" size="1" initval="0x00" caption="HOST_PIPE Bus Access Period of Pipe">
          <bitfield name="BITINTERVAL" caption="Bit Interval" mask="0xFF"/>
        </register>
        <register modes="HOST" name="PSTATUSCLR" offset="0x4" rw="W" size="1" atomic-op="clear:PSTATUS" initval="0x00" caption="HOST_PIPE End Point Pipe Status Clear">
          <bitfield name="DTGL" caption="Data Toggle clear" mask="0x1"/>
          <bitfield name="CURBK" caption="Curren Bank clear" mask="0x4"/>
          <bitfield name="PFREEZE" caption="Pipe Freeze Clear" mask="0x10"/>
          <bitfield name="BK0RDY" caption="Bank 0 Ready Clear" mask="0x40"/>
          <bitfield name="BK1RDY" caption="Bank 1 Ready Clear" mask="0x80"/>
        </register>
        <register modes="HOST" name="PSTATUSSET" offset="0x5" rw="W" size="1" atomic-op="set:PSTATUS" initval="0x00" caption="HOST_PIPE End Point Pipe Status Set">
          <bitfield name="DTGL" caption="Data Toggle Set" mask="0x1"/>
          <bitfield name="CURBK" caption="Current Bank Set" mask="0x4"/>
          <bitfield name="PFREEZE" caption="Pipe Freeze Set" mask="0x10"/>
          <bitfield name="BK0RDY" caption="Bank 0 Ready Set" mask="0x40"/>
          <bitfield name="BK1RDY" caption="Bank 1 Ready Set" mask="0x80"/>
        </register>
        <register modes="HOST" name="PSTATUS" offset="0x6" rw="R" size="1" initval="0x00" caption="HOST_PIPE End Point Pipe Status">
          <bitfield name="DTGL" caption="Data Toggle" mask="0x1"/>
          <bitfield name="CURBK" caption="Current Bank" mask="0x4"/>
          <bitfield name="PFREEZE" caption="Pipe Freeze" mask="0x10"/>
          <bitfield name="BK0RDY" caption="Bank 0 ready" mask="0x40"/>
          <bitfield name="BK1RDY" caption="Bank 1 ready" mask="0x80"/>
        </register>
        <register modes="HOST" name="PINTFLAG" offset="0x7" rw="RW" size="1" atomic-op="clear:PINTFLAG" initval="0x00" caption="HOST_PIPE Pipe Interrupt Flag">
          <bitfield name="TRCPT0" caption="Transfer Complete 0 Interrupt Flag" mask="0x1"/>
          <bitfield name="TRCPT1" caption="Transfer Complete 1 Interrupt Flag" mask="0x2"/>
          <bitfield name="TRFAIL" caption="Error Flow Interrupt Flag" mask="0x4"/>
          <bitfield name="PERR" caption="Pipe Error Interrupt Flag" mask="0x8"/>
          <bitfield name="TXSTP" caption="Transmit  Setup Interrupt Flag" mask="0x10"/>
          <bitfield name="STALL" caption="Stall Interrupt Flag" mask="0x20"/>
        </register>
        <register modes="HOST" name="PINTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:PINTENCLR" initval="0x00" caption="HOST_PIPE Pipe Interrupt Flag Clear">
          <bitfield name="TRCPT0" caption="Transfer Complete 0 Disable" mask="0x1"/>
          <bitfield name="TRCPT1" caption="Transfer Complete 1 Disable" mask="0x2"/>
          <bitfield name="TRFAIL" caption="Error Flow Interrupt Disable" mask="0x4"/>
          <bitfield name="PERR" caption="Pipe Error Interrupt Disable" mask="0x8"/>
          <bitfield name="TXSTP" caption="Transmit Setup Interrupt Disable" mask="0x10"/>
          <bitfield name="STALL" caption="Stall Inetrrupt Disable" mask="0x20"/>
        </register>
        <register modes="HOST" name="PINTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:PINTENSET" initval="0x00" caption="HOST_PIPE Pipe Interrupt Flag Set">
          <bitfield name="TRCPT0" caption="Transfer Complete 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="TRCPT1" caption="Transfer Complete 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="TRFAIL" caption="Error Flow Interrupt Enable" mask="0x4"/>
          <bitfield name="PERR" caption="Pipe Error Interrupt Enable" mask="0x8"/>
          <bitfield name="TXSTP" caption="Transmit  Setup Interrupt Enable" mask="0x10"/>
          <bitfield name="STALL" caption="Stall Interrupt Enable" mask="0x20"/>
        </register>
      </register-group>
      <register-group name="USB" caption="Universal Serial Bus">
        <mode name="DEVICE" qualifier="USB.CTRLA.MODE" value="0" caption="USB is Device"/>
        <mode name="HOST" qualifier="USB.CTRLA.MODE" value="1" caption="USB is Host"/>
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby Mode" mask="0x4"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0x80" values="USB_CTRLA__MODE"/>
        </register>
        <register name="SYNCBUSY" offset="0x2" rw="R" size="1" initval="0x00" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Synchronization Busy" mask="0x2"/>
        </register>
        <register name="QOSCTRL" offset="0x3" rw="RW" size="1" initval="0x0F" caption="USB Quality Of Service">
          <bitfield name="CQOS" caption="Configuration Quality of Service" mask="0x3"/>
          <bitfield name="DQOS" caption="Data Quality of Service" mask="0xC"/>
        </register>
        <register modes="DEVICE" name="CTRLB" offset="0x8" rw="RW" size="2" initval="0x0001" caption="DEVICE Control B">
          <bitfield name="DETACH" caption="Detach" mask="0x1"/>
          <bitfield name="UPRSM" caption="Upstream Resume" mask="0x2"/>
          <bitfield name="SPDCONF" caption="Speed Configuration" mask="0xC" values="USB_DEVICE_CTRLB__SPDCONF"/>
          <bitfield name="NREPLY" caption="No Reply" mask="0x10"/>
          <bitfield name="TSTJ" caption="Test mode J" mask="0x20"/>
          <bitfield name="TSTK" caption="Test mode K" mask="0x40"/>
          <bitfield name="TSTPCKT" caption="Test packet mode" mask="0x80"/>
          <bitfield name="OPMODE2" caption="Specific Operational Mode" mask="0x100"/>
          <bitfield name="GNAK" caption="Global NAK" mask="0x200"/>
          <bitfield name="LPMHDSK" caption="Link Power Management Handshake" mask="0xC00" values="USB_DEVICE_CTRLB__LPMHDSK"/>
        </register>
        <register modes="HOST" name="CTRLB" offset="0x8" rw="RW" size="2" initval="0x0000" caption="HOST Control B">
          <bitfield name="RESUME" caption="Send USB Resume" mask="0x2"/>
          <bitfield name="SPDCONF" caption="Speed Configuration for Host" mask="0xC" values="USB_HOST_CTRLB__SPDCONF"/>
          <bitfield name="AUTORESUME" caption="Auto Resume Enable" mask="0x10"/>
          <bitfield name="TSTJ" caption="Test mode J" mask="0x20"/>
          <bitfield name="TSTK" caption="Test mode K" mask="0x40"/>
          <bitfield name="SOFE" caption="Start of Frame Generation Enable" mask="0x100"/>
          <bitfield name="BUSRESET" caption="Send USB Reset" mask="0x200"/>
          <bitfield name="VBUSOK" caption="VBUS is OK" mask="0x400"/>
          <bitfield name="L1RESUME" caption="Send L1 Resume" mask="0x800"/>
        </register>
        <register modes="DEVICE" name="DADD" offset="0xA" rw="RW" size="1" initval="0x00" caption="DEVICE Device Address">
          <bitfield name="DADD" caption="Device Address" mask="0x7F"/>
          <bitfield name="ADDEN" caption="Device Address Enable" mask="0x80"/>
        </register>
